In [7]:
import numpy as np
import pandas as pd

In [9]:
data = np.random.randn(4,3) #random bir matrix oluşturalım

In [10]:
data

array([[ 1.22138706, -1.9713084 , -0.99187072],
       [-1.04016337, -0.35641512,  1.03973314],
       [ 0.48579046, -0.17528485,  0.05908458],
       [-0.20948219, -0.17302065,  2.0139026 ]])

In [17]:
data_Frame = pd.DataFrame(data) #matriximiz ile dataframe oluşturalım

In [18]:
dataFrame

          0         1         2
0  1.221387 -1.971308 -0.991871
1 -1.040163 -0.356415  1.039733
2  0.485790 -0.175285  0.059085
3 -0.209482 -0.173021  2.013903

In [19]:
dataFrame[0] #ilk sütunu getirir (satır değil)

0    1.221387
1   -1.040163
2    0.485790
3   -0.209482
Name: 0, dtype: float64

In [20]:
type(dataFrame)

pandas.core.frame.DataFrame

In [21]:
type(dataFrame[0])

pandas.core.series.Series

In [28]:
yeni_data_frame= pd.DataFrame(data,index=["Ali","Veli","Ceyhun","Deniz"],columns = ["Maas","Yas","Calısma Saati"])
#row ve column indexlerinin adını düzenledik

In [29]:
yeni_data_frame

            Maas       Yas  Calısma Saati
Ali     1.221387 -1.971308      -0.991871
Veli   -1.040163 -0.356415       1.039733
Ceyhun  0.485790 -0.175285       0.059085
Deniz  -0.209482 -0.173021       2.013903

In [30]:
yeni_data_frame["Yas"]

Ali      -1.971308
Veli     -0.356415
Ceyhun   -0.175285
Deniz    -0.173021
Name: Yas, dtype: float64

In [31]:
yeni_data_frame["Maas"]

Ali       1.221387
Veli     -1.040163
Ceyhun    0.485790
Deniz    -0.209482
Name: Maas, dtype: float64

In [32]:
yeni_data_frame[["Maas","Calısma Saati"]] #istediğim sütunları gösterir

            Maas  Calısma Saati
Ali     1.221387      -0.991871
Veli   -1.040163       1.039733
Ceyhun  0.485790       0.059085
Deniz  -0.209482       2.013903

In [33]:
yeni_data_frame.loc["Ali"] #istenen satırın değerlerini getirir

Maas             1.221387
Yas             -1.971308
Calısma Saati   -0.991871
Name: Ali, dtype: float64

In [34]:
yeni_data_frame.iloc[0] #index bazlı olarak istenen satırı getirir

Maas             1.221387
Yas             -1.971308
Calısma Saati   -0.991871
Name: Ali, dtype: float64

In [35]:
yeni_data_frame

            Maas       Yas  Calısma Saati
Ali     1.221387 -1.971308      -0.991871
Veli   -1.040163 -0.356415       1.039733
Ceyhun  0.485790 -0.175285       0.059085
Deniz  -0.209482 -0.173021       2.013903

In [36]:
yeni_data_frame["Tecrube"] = yeni_data_frame["Yas"]/2
#yeni kolon ekleme

In [37]:
yeni_data_frame

            Maas       Yas  Calısma Saati   Tecrube
Ali     1.221387 -1.971308      -0.991871 -0.985654
Veli   -1.040163 -0.356415       1.039733 -0.178208
Ceyhun  0.485790 -0.175285       0.059085 -0.087642
Deniz  -0.209482 -0.173021       2.013903 -0.086510

In [40]:
yeni_data_frame.drop("Tecrube", axis=1) 
#istenen sütunu sildik
#axis 1 deme sebebimiz sütun ismi olduğunu belirtmek

            Maas       Yas  Calısma Saati
Ali     1.221387 -1.971308      -0.991871
Veli   -1.040163 -0.356415       1.039733
Ceyhun  0.485790 -0.175285       0.059085
Deniz  -0.209482 -0.173021       2.013903

In [41]:
yeni_data_frame.drop("Veli", axis=0)
#istenen satırı sildim
#axis = 0 deme sebebi bunun bir satır olduğunu belirtmek

            Maas       Yas  Calısma Saati   Tecrube
Ali     1.221387 -1.971308      -0.991871 -0.985654
Ceyhun  0.485790 -0.175285       0.059085 -0.087642
Deniz  -0.209482 -0.173021       2.013903 -0.086510

In [43]:
yeni_data_frame
#asıl dataframe hala değişmemiş

            Maas       Yas  Calısma Saati   Tecrube
Ali     1.221387 -1.971308      -0.991871 -0.985654
Veli   -1.040163 -0.356415       1.039733 -0.178208
Ceyhun  0.485790 -0.175285       0.059085 -0.087642
Deniz  -0.209482 -0.173021       2.013903 -0.086510

In [51]:
yeni_data_frame["Emeklilik Yasi"]= yeni_data_frame["Yas"]+ yeni_data_frame["Yas"]

In [52]:
yeni_data_frame

            Maas       Yas  Calısma Saati  Emeklilik Yasi
Ali     1.221387 -1.971308      -0.991871       -3.942617
Veli   -1.040163 -0.356415       1.039733       -0.712830
Ceyhun  0.485790 -0.175285       0.059085       -0.350570
Deniz  -0.209482 -0.173021       2.013903       -0.346041

In [53]:
yeni_data_frame.drop("Emeklilik Yasi", axis=1, inplace=True)
#inplace=True dersek istenen yeri asıl dataframeden de temelli olarak siler

In [54]:
yeni_data_frame

            Maas       Yas  Calısma Saati
Ali     1.221387 -1.971308      -0.991871
Veli   -1.040163 -0.356415       1.039733
Ceyhun  0.485790 -0.175285       0.059085
Deniz  -0.209482 -0.173021       2.013903

In [56]:
yeni_data_frame.loc["Ceyhun"]["Yas"] 
#istenen elemanı bulma

-0.17528484965304433

In [57]:
yeni_data_frame.loc["Ceyhun","Yas"]
#böyle de bulunabilir

-0.17528484965304433

In [58]:
yeni_data_frame < 0
#0dan küçükleri göster

         Maas   Yas  Calısma Saati
Ali     False  True           True
Veli     True  True          False
Ceyhun  False  True          False
Deniz    True  True          False

In [59]:
boolean_frame =yeni_data_frame < 0

In [60]:
yeni_data_frame

            Maas       Yas  Calısma Saati
Ali     1.221387 -1.971308      -0.991871
Veli   -1.040163 -0.356415       1.039733
Ceyhun  0.485790 -0.175285       0.059085
Deniz  -0.209482 -0.173021       2.013903

In [61]:
boolean_frame

         Maas   Yas  Calısma Saati
Ali     False  True           True
Veli     True  True          False
Ceyhun  False  True          False
Deniz    True  True          False

In [63]:
yeni_data_frame[boolean_frame]
#başka bir değişkene eşitleyip o değişkeni içinde çağırırsak sadece o istenenleri gösterir

            Maas       Yas  Calısma Saati
Ali          NaN -1.971308      -0.991871
Veli   -1.040163 -0.356415            NaN
Ceyhun       NaN -0.175285            NaN
Deniz  -0.209482 -0.173021            NaN

In [67]:
yeni_data_frame[yeni_data_frame["Maas"] >  0]
#istenen özelliğe uymayan satırları göstermiyor

            Maas       Yas  Calısma Saati
Ali     1.221387 -1.971308      -0.991871
Ceyhun  0.485790 -0.175285       0.059085

In [68]:
yeni_data_frame

            Maas       Yas  Calısma Saati
Ali     1.221387 -1.971308      -0.991871
Veli   -1.040163 -0.356415       1.039733
Ceyhun  0.485790 -0.175285       0.059085
Deniz  -0.209482 -0.173021       2.013903

In [75]:
yeni_data_frame.reset_index()
#index şelinde ayrı kolon açar

    index      Maas       Yas  Calısma Saati
0     Ali  1.221387 -1.971308      -0.991871
1    Veli -1.040163 -0.356415       1.039733
2  Ceyhun  0.485790 -0.175285       0.059085
3   Deniz -0.209482 -0.173021       2.013903

In [77]:
yeni_data_frame
#yukarıda inplace kullanmadığımız için ana frame değişmedi

            Maas       Yas  Calısma Saati
Ali     1.221387 -1.971308      -0.991871
Veli   -1.040163 -0.356415       1.039733
Ceyhun  0.485790 -0.175285       0.059085
Deniz  -0.209482 -0.173021       2.013903

In [78]:
yeni_index_listesi = ["A","V","C","D"]

In [79]:
yeni_data_frame["Bas Harf"] = yeni_index_listesi
#istenen sütunu ekledim tabloma

In [80]:
yeni_data_frame

            Maas       Yas  Calısma Saati Bas Harf
Ali     1.221387 -1.971308      -0.991871        A
Veli   -1.040163 -0.356415       1.039733        V
Ceyhun  0.485790 -0.175285       0.059085        C
Deniz  -0.209482 -0.173021       2.013903        D

In [82]:
yeni_data_frame.set_index("Bas Harf")
#istenen sütunu(kolonu) en başa yerleştirdim

              Maas       Yas  Calısma Saati
Bas Harf
A         1.221387 -1.971308      -0.991871
V        -1.040163 -0.356415       1.039733
C         0.485790 -0.175285       0.059085
D        -0.209482 -0.173021       2.013903

In [84]:
yeni_data_frame

            Maas       Yas  Calısma Saati Bas Harf
Ali     1.221387 -1.971308      -0.991871        A
Veli   -1.040163 -0.356415       1.039733        V
Ceyhun  0.485790 -0.175285       0.059085        C
Deniz  -0.209482 -0.173021       2.013903        D

In [87]:
yeni_data_frame.set_index("Bas Harf", inplace=True)
#inplace yaptığım için asıl tablo da temelli değişecek
#yanlışlıkla 2 kere çalıştırdığım için kod bulunamadı diyor, aslında kod doğru sorun yok

KeyError: "None of ['Bas Harf'] are in the columns"

In [86]:
yeni_data_frame

              Maas       Yas  Calısma Saati
Bas Harf
A         1.221387 -1.971308      -0.991871
V        -1.040163 -0.356415       1.039733
C         0.485790 -0.175285       0.059085
D        -0.209482 -0.173021       2.013903

In [89]:
yeni_data_frame.loc["A"]

Maas             1.221387
Yas             -1.971308
Calısma Saati   -0.991871
Name: A, dtype: float64

In [1]:
ilk_indexler =["Parks and Recs","Parks and Recs","Parks and Recs","HIMYM","HIMYM","HIMYM"]

In [2]:
ic_indexler = ["Leslie","Ron","Tom","Ted","Barney","Robin"]

In [4]:
birlesmis_index =  list(zip(ilk_indexler,ic_indexler))

In [5]:
birlesmis_index

[('Parks and Recs', 'Leslie'),
 ('Parks and Recs', 'Ron'),
 ('Parks and Recs', 'Tom'),
 ('HIMYM', 'Ted'),
 ('HIMYM', 'Barney'),
 ('HIMYM', 'Robin')]

In [8]:
birlesmis_index = pd.MultiIndex.from_tuples(birlesmis_index)
#dataframe i böyle oluşturduk

In [9]:
birlesmis_index

MultiIndex([('Parks and Recs', 'Leslie'),
            ('Parks and Recs',    'Ron'),
            ('Parks and Recs',    'Tom'),
            (         'HIMYM',    'Ted'),
            (         'HIMYM', 'Barney'),
            (         'HIMYM',  'Robin')],
           )

In [14]:
type(birlesmis_index)

pandas.core.indexes.multi.MultiIndex

In [15]:
sitcom_listem = [[35,"Counselwoman"],[47,"Director"],[32,"Investor"],[25,"Architect"],[28,"Please"],[24,"Reporter"]]

In [16]:
sitcom_numpy_dizim = np.array(sitcom_listem)
#numpy dizisine çevirdim

In [17]:
sitcom_data_frame = pd.DataFrame(sitcom_numpy_dizim, index=birlesmis_index, columns=["Yas","Meslek"])

In [18]:
sitcom_data_frame

                      Yas        Meslek
Parks and Recs Leslie  35  Counselwoman
               Ron     47      Director
               Tom     32      Investor
HIMYM          Ted     25     Architect
               Barney  28        Please
               Robin   24      Reporter

In [20]:
sitcom_data_frame.loc["HIMYM"]

       Yas     Meslek
Ted     25  Architect
Barney  28     Please
Robin   24   Reporter

In [21]:
sitcom_data_frame.loc["HIMYM"].loc["Ted"]

Yas              25
Meslek    Architect
Name: Ted, dtype: object

In [25]:
sitcom_data_frame.index.names = ["Dizi Adı","Karakter"]
#indexlere isim verdim

In [26]:
sitcom_data_frame

                        Yas        Meslek
Dizi Adı       Karakter
Parks and Recs Leslie    35  Counselwoman
               Ron       47      Director
               Tom       32      Investor
HIMYM          Ted       25     Architect
               Barney    28        Please
               Robin     24      Reporter